{
    "current_label": "experience_hospitality",
    "description": "",
    "labels": {
        "experience_hospitality": {
            "keyword_groups": {
                "1": {
                    "annotated_random_sample": [
                        [
                            "Keung Kee Restaurant is seriously the most overrated places I had ever been too and the reviews here say otherwise.   I find it astounding that people think this place is great, sure the food is good but the service is terrible. It took them awhile to get my order and food despite the restaurant looking less busy and they still screwed it up. I had ordered their Keung Kee Chicken Congee (their speciality congee) and it took them around half a hour to bring it; seriously congee should be the first thing that they will bring.  What's even worse is that I wanted chinese doughnuts to compliment with the congee but they didn't even bring it until the end when I was full. Also they screwed up my order and thought that they are clever enough to add something that I didn't order.   Horrible Service and decent food, the decor may look enticing but don't go to this restaurant....",
                            "correct"
                        ],
                        [
                            "This is a cute LITTLE place and close to home so I want to love it but I just can't. We have been numerous times over the years but it looks like this last time was our last. The service used to be spot on and this time we spent lot of of time waiting. Waiting for a table, waiting for someone to take our drink order, waiting for our food, and then waiting a ridiculous amount of time for our check. My son actually sat with his hand raised like they do in school in hopes that someone, anyone, would come over to our table. I could hear the couple next to use complaining through their meal as well due to forgotten items and waiting for their server.  The food was simply ok this past visit. The flavors used to be vibrant and when you ordered something spicy it had some kick but lately everything just seems a little off and bland. We had pad Thai, sweet and sour chicken and a chicken red curry dish. None of the items were bad but they certainly weren't memorable either. The angel wings were a bright spot in the meal and recommended if you stop by. The Thai tea was also quite good.   If you are lucky maybe you will get a seat near the fish tank which gives you something to do while you wait.",
                            "correct"
                        ],
                        [
                            "Since discovering Fresh a few months ago, I've been almost once a week.  I'm not vegetarian, but it has quickly become one of my favourite dining destinations for a healthy meal. I can't get enough!  I'm a huge fan of the holiday wrap (with crispy tofu and white cheddar) paired with any of the tasty, homemade soups.  I also love the bbq burger, a very filling veggie burger topped with bbq sauce, quinoa battered onion rings, banana peppers, and vegan mayo.   I would also recommend the buddha bowl with soba noodles, topped with tofu, bean sprouts, cucumber, tomato and peanut sauce. It was so big I couldn't finish it- next time I'll order the \"baby\" buddha (half portions are available for all the Fresh bowls).  I recently tried the spring rolls- at $8 for 2 large rolls, they're a bit pricey, but very tasty!  I was a bit hesitant to try the vegan carrot cake with cream cheese icing for dessert, but it was actually DELICIOUS. You won't believe it's vegan!  Most of the time the service is very good. I find that it's better at the Queen West location than the Spadina location. One pet-peeve of mine is that they frequently are out of avocado, an integral ingredient in the holiday wrap....but this only constitutes a minor blip in an otherwise consistently positive experience!",
                            "correct"
                        ],
                        [
                            "This place is always busy and deservingly so.  The food is delicious, the service is great,  and they have very reasonable prices! I've tried most of their breakfast foods and even their sandwiches,  soups,  and pasta and everything has always been delicious. The place is never dirty or unkempt. I have a very fussy 2 year old and the same nice lady now recognizes us when we come in and gives him crackers to keep him busy until our food comes,  which is never a long time. This will remain one of our favorite IHOP alternatives since we love supporting local businesses!",
                            "correct"
                        ],
                        [
                            "With an interior combining a clean, attractive mix of whites, light browns, and light wood, Pearl gives off the aura of being a casually upscale restaurant. The view out the window is of Centre Island, which must be beautiful during the day in the Spring and Summer when there's green on the trees. However, I'd imagine that there's not much of a view at night or during the winter as there are no buildings and seemingly nothing to light up the island.  The service is attentive and the food pretty good, the menu featuring dishes I hadn't tried before--namely curry cuttlefish. However, that said, the prices at this restaurant are absolutely absurd,  I have never seen prices like on this menu: almost $3 for a glass of soda, $9 for an appetizer of calamari, and $17 for ginger chicken. There are a few lunch specials starting at $12. While I enjoyed my lunch, the prices alone are enough to discourage me from returning.",
                            "correct"
                        ],
                        [
                            "Price like Guu, taste like Guu without the line up. Food was solid and the service was great. We were there for 2 hours and it was quite relaxing sitting in the patio.  Maybe it was because everyone was avoiding Toronto during the Pan Am games.",
                            "correct"
                        ],
                        [
                            "I like the food. So it's worth coming but the service is horrible. It might be the management or that they just can't find kind friendly wait staff. I'd rather drive a bit further",
                            "correct"
                        ],
                        [
                            "2nd time around was much much better.  We had a great time, a great meal and service was spot on.  Cookies on the way out are awesome! I'll go back!",
                            "correct"
                        ],
                        [
                            "This place is in an amazing location and the look/layout is very nice. The food is only so so and really should have at least the basic pub fare but doesn't. The prices are a little steep considering but I guess they figure they are in a trendy area so they must be as well?  I have actually never had problems with service myself but a lot of people I know have complained of it and said for that reason would not return. I work within a few feet so it is very handy but if it's my choice or I have the time will travel to just about any pub and know I will do as well if not better for price and quality. Plus with all the great choices in the area why not?",
                            "correct"
                        ],
                        [
                            "I hated this place. Just weird looks and bad service from the staff because me and my gf were the only non hipsters in the place. It's like they were pissed we were in their club. Similar experience at boxcar social today as well. Wouldn't suggest it to anyone or wallace and co",
                            "correct"
                        ]
                    ],
                    "confidence": 1.0,
                    "created_timestamp": 1621602387,
                    "created_timestamp_readable": "21. May 2021 03:06PM",
                    "enabled": true,
                    "keywords": [
                        "service"
                    ],
                    "sample_size": 10
                },
                "2": {
                    "annotated_random_sample": [
                        [
                            "After searching for a close Thai place I came across The Green Lady. I ordered the dinner for two and was surprised by the portions in comparison to the price. The food started off delicious but that's where it ends. After my girlfriend found one piece of hair we shook it off and continued to eat. Right after she found another hair then another and I started to search the food we didn't open only to find hairs in those as well! I called the place and told them and they say \"that's not possible\" and \"unbelievable\". After 5mins going back and forth with the manager she told me to return the food (after I had it delivered) I said no and fought with her to come pick up the food and I would pay for what we ate because I just wanted the situation resolved not a free meal. In the end they refunded us the whole amount. It's unfortunate because we were enjoying the food but due to the experience and quality control we will never order from there again.",
                            "correct"
                        ],
                        [
                            "Tong Ha Supreme BBQ just opened inside  the food court at Silver Star Blvd a month or so ago.  Sparkling clean and just shining under all the spot lights!  I just could not resist their BBQ ducks.. one of the prettiest thing I see out of all the other BBQ joint I been to! Big, Fat and juicy looking!   BBQ Duck and Pork with Rice ($5.99) was excellent!  The use of better ingredients, more care in preparation really resulted in a much delicious BBQ! Even the sauce has this dedicate balance of sweet and savoury. Not just overly salty or loaded with MSG!  Staffs here are all so cheerful and really proud of their products. The owner even give me some roasted pork on the side to try! I think I want roasted pork next time too as the skin is crispy and the meat so tender!  BTW, Tong Ha does have BBQ Goose! Goose....I want to have some Goose....  15% Grand Opening Special!",
                            "correct"
                        ],
                        [
                            "I come here all the time to get work done. I get so much more done here than I do at home sometime. Latte and the Hive are great drinks.  I a certain employee would stop making so much noise behind the counter when he is cleaning out something with every drink. He slams the metal thing against the counter. If he didn't, this place would def get 5 stars.",
                            "correct"
                        ],
                        [
                            "Tonight I had takeout from Live, paleo bowl.$20, I was very very very  upset when I reached home to find that a spoon full of food is what I got. I will never go back to this establishment. Way to overpriced. The customer service is terrible, it's not the first time I've had a problem there.",
                            "correct"
                        ],
                        [
                            "Awesome French Toast with caramelized bananas.  Eggs with wild mushrooms outstanding.  My husband had Selena burrito (plus more than half of my French Toast.).   4 stars only because it took awhile for server to take order and it was not that busy.",
                            "correct"
                        ],
                        [
                            "If I could give this place no stars I would. The owner is extremely rude to the staff in front of customers. I was so surprised the staff was letting her talk to them like that. And the food. It's okay. I ordered Kung pao chicken and got a plate full of vegetables with maybe 5 pieces of chicken. My husband ordered Mongolian beef and he got a plate of onions with maybe 3 pieces of beef. Wasn't work 30 bucks. Not going here again.",
                            "correct"
                        ],
                        [
                            "This review is for the Adelaide location.   Interior is really classy! Overall good environment for large groups.  But it is really hot/stuffy.  4/5  Food was decent. 3/5 Servers carry the different meats around and cut you a piece at your table. I liked the top sirloin and bacon wrapped filet mignon the best. Chimichurri was okay too.  The garlic cube and flank steak were a bit overcooked/bland.   There is also a salad/cooked foods bar which I ate more of. I recommend: Spinach salad, mango salad, kale, broccoli, and mussels.   Service was disappointing.  2/5  1. Servers carrying the meats came really fast.. I guess that's how they operate but i would feel rushed at times.  2. Servers carrying meats rarely smile, are rude, and impatient. They didn't give instruction whether I should use my tongs or if they would serve it directly to the plate, so they would just stand there looking impatient.  3. My friend was busy talking and one rudely interrupted \"Excuse Me\" to ask if she wanted the meat.  4. While cutting the meat, the piece fell on the table but he didn't say anything, leaving my friend to reluctantly pick it up from the table. When she asked for another piece, he shaved off a tiny, thin piece and quickly left the table.  5. My friend asked for ribs and the server said she would check. When my other friend checked up on the order, she said \"I know, he already asked me\". We were then told it would take 15 mins to make, which ended up to be more like 30 mins. And when it arrived, it was not the same ribs he had earlier - this one tasted like brisket and had no bone; it was more like the inside of the meat without the crust. It was unevenly seasoned with some pieces no taste and others salty.   Entertainment: Brazillian dancers  Verdict: Decent buffet food for a unique experience, but poor service.",
                            "correct"
                        ],
                        [
                            "This may be the best Indian I have ever had.  I've had several curries on this long trip, but wow - this one wins the prize.  They are also BYOB, which is fairly common in the States at Asian and Indian restaurants, but perhaps not as much here?  So it was a very nice treat to bring loads of wine and beer for the group.  Dimly lit, casual atmosphere, and friendly service.  There were about ten of us in a group, but everything went really smoothly.  Started with some delicious chicken pakoras with a few different sauces, then followed it up with the chicken deshi khani and a side of the best, freshest sag alu I've ever had.  The deshi khani is advertised as being \"limited availability,\" and a special, particularly authentic curry.  Spicy, rich, and succulent, it was one of the best curries I've ever had.  And the sag alu!  Not the fatty (but delicious) creamy spinach you usually get at Indian restaurants, this was fresh and brimming with spice.  Would've been happy to get it as a main with paneer, but I didn't think to do so because I figured it would be pretty standard instead of spectacular, and I was wrong!  My friend ordered something they used to serve but is no longer printed on the menu and they still make it for her.  Fragrant pilau rice and hot, crispy garlic naan made this such an outstanding meal.  I'd beeline here the next time I was in Edinburgh because as far as I'm concerned, this is as good as Indian gets.",
                            "incorrect"
                        ],
                        [
                            "This is a little hole in the wall type of spot that you'd totally miss should you not be looking specifically for it. It's right next to an adult shop too, so even more obscure I'd say, unless of course you were wanting to get your naughty purchases before or after!   Sonoran tacos just recently closed to make it a tad bigger- there is a bit more seating on the inside and the menu changed although not a whole bunch but they now added beans and a burrito to their menu. Before they only offered tacos, caramelos (quesadilla with meat in it), and vampiros (hard shell flat crispy tortilla with beans cheese meat)! All of which have been delicious. The sizes are fairly small but they definitely fill you up. They have a serve yourself salsa bar there as well and usually have radishes and cucumbers - which I love to lemon up and salt to enjoy before or with my tacos.   The pastor is delicious but nothing beats their carne asada. Perfectly seasoned and tender and tasty! My friends and I have deemed it \"porn tacos\" and usually try to come at least once a month because it's just worth it!",
                            "incorrect"
                        ],
                        [
                            "First review ever here. We were seated but not given water or menu. After 10-15 minutes we asked for a menu.  Then we asked if we could order.  Then we waited for one solid hour.  Imagine sitting in a half empty place and your food doesn't come out for an hour.  You ask the owner/manager when you can expect your food. He turns to your spouse and says he is sorry he is married to someone like you. Both of you blow up.  He states that he no longer want to serve you.  You leave after sitting in a booth for one hour.",
                            "correct"
                        ]
                    ],
                    "confidence": 0.8,
                    "created_timestamp": 1621602617,
                    "created_timestamp_readable": "21. May 2021 03:10PM",
                    "enabled": true,
                    "keywords": [
                        "owner",
                        "server",
                        "cashier",
                        "interaction",
                        "manager",
                        "serve",
                        "member",
                        "worker",
                        "greeting",
                        "genuine",
                        "employee",
                        "cashiers",
                        "kindness",
                        "engaging",
                        "customer"
                    ],
                    "sample_size": 10
                }
            }
        }
    },
    "max_keyword_group_id": 2,
    "name": ""
}